# ——— Formulae  ———
brew "deno"
brew "gh"
brew "mas"
brew "mosh"
brew "node"
brew "pnpm"
brew "starship"
brew "bat"
brew "rustup"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# ——— Casks  ———
cask "claude-code"
cask "font-sf-mono-nerd-font-ligaturized"
cask "steam"
cask "zed"

# ——— Apps  ———
#mas "Wipr 2", id: 1662217862
#mas "Xcode", id: 497799835
#mas "Logic Pro", id: 634148309
#mas "Final Cut Pro", id: 424389933
#mas "Pixelmator Pro", id: 1289583905
#mas "Motion", id: 434290957
#mas "Mainstage", id: 634159523
#mas "Keynote", id: 361285480
#mas "Pages", id: 361309726
#mas "Numbers", id: 361304891
#mas "Compressor", id: 424390742
#
