# CLI tools
brew "fzf"
brew "gh"
brew "mise"
brew "neovim"
brew "oh-my-posh"
brew "zoxide"

if OS.mac?
  # GUI apps
  cask "claude-code"
  cask "codex"
  cask "crossover"
  cask "ghostty"
  cask "orbstack"
  cask "screen-studio"
  cask "steam"
  cask "zed"

  # Fonts
  cask "font-sf-mono-nerd-font-ligaturized"
  cask "font-sf-pro"

  # Mac App Store
  mas "Compressor",     id: 424390742
  mas "Final Cut Pro",  id: 424389933
  mas "Keynote",        id: 361285480
  mas "Logic Pro",      id: 634148309
  mas "MainStage",      id: 634159523
  mas "Motion",         id: 434290957
  mas "NordVPN",        id: 905953485
  mas "Numbers",        id: 361304891
  mas "Pages",          id: 361309726
  mas "Pixelmator Pro", id: 1289583905
  mas "Wipr 2",         id: 1662217862
end
