brew "cloudflared"
brew "gh"
brew "lazygit"
brew "mas"
brew "neovim"
brew "opencode"
brew "starship"
brew "swiftly"
brew "typst"

cask "codex"
cask "crossover"
cask "ghostty"
cask "steam"

mas "Final Cut Pro", id: 424389933
mas "Logic Pro", id: 634148309
mas "Motion", id: 434290957
mas "Pixelmator Pro", id: 1289583905
mas "Wipr 2", id: 1662217862
mas "Xcode", id: 497799835
